Repository: Tommycik/appTesi
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: it

source: Error
it: Errore

source: Inference
it: Inferenza

source: Training
it: Addestramento

source: Results
it: Risultati

source: Connect to Lambda
it: Connetti a Lambda

source: Inference Job Terminated
it: Job di inferenza terminato

source: Training Job Terminated
it: Job di addestramento terminato

source: Open full resolution
it: Apri a piena risoluzione

source: Elapsed time: %(seconds)s seconds
it: Tempo trascorso: %(seconds)s secondi

source: Connection lost, retrying...
it: Connessione persa, nuovo tentativo...

source: SSH client not connected
it: Client SSH non connesso

source: Progress: %(progress)d%%
it: Avanzamento: %(progress)d%%

source: Map: %(progress)d%%
it: Mappa: %(progress)d%%

source: Fetching files: %(progress)d%%
it: Scaricamento file: %(progress)d%%

source: Loading checkpoint: %(progress)d%%
it: Caricamento checkpoint: %(progress)d%%

source: Processing Files: %(progress)d%%
it: Elaborazione file: %(progress)d%%

source: Work started
it: Lavoro iniziato

source: ⚠ Connection lost, retrying...
it: ⚠ Connessione persa, nuovo tentativo...

source: Lambda API key is not configured!
it: Chiave API di Lambda non configurata!

source: Lambda instance not found.
it: Istanza Lambda non trovata.

source: Instance not active (status=%(status)s)
it: Istanza non attiva (stato=%(status)s)

source: Configuring Docker daemon...
it: Configurazione demone Docker...

source: Pulling Docker image %(image)s...
it: Scaricamento immagine Docker %(image)s...

source: Removing any old container...
it: Rimozione di eventuali vecchi container...

source: Starting new container...
it: Avvio nuovo container...

source: Installing extra Python packages
it: Installazione pacchetti Python aggiuntivi

source: Container was not created at all.
it: Il container non è stato creato.

source: Container failed to start:
it: Avvio del container fallito:

source: Updating repo inside container...
it: Aggiornamento repository nel container...

source: Lambda is ready.
it: Lambda è pronto.

source: Connect Lambda Failed
it: Connessione a Lambda fallita

source: Connect Lambda Logs
it: Log di connessione a Lambda

source: Continue to Home
it: Torna alla Home

source: Before using this app, ensure the lambda remote machine is ready.
it: Prima di usare questa app, assicurati che la macchina remota Lambda sia pronta.

source: Connect to Lambda & Pull Docker Image
it: Connetti a Lambda e scarica immagine Docker

source: Connecting...
it: Connessione...

source: Lambda instance is connected and Docker image is ready.
it: L’istanza Lambda è connessa e l’immagine Docker è pronta.

source: Go to Inference Page
it: Vai alla pagina di inferenza

source: Go to Training Page
it: Vai alla pagina di addestramento

source: Go to Results Page
it: Vai alla pagina dei risultati

source: Getting Started
it: Per iniziare

source: Create a Lambda Cloud account & API key.
it: Crea un account Lambda Cloud e una chiave API.

source: Start the Lambda machine and wait until it's started
it: Avvia la macchina Lambda e attendi che sia pronta

source: Make sure the Lambda machine IP, Lambda API key and region are set correctly (IP: %(ip)s, Region: %(region)s).
it: Assicurati che l’IP della macchina Lambda, la chiave API e la regione siano impostati correttamente (IP: %(ip)s, Regione: %(region)s).

source: Generate images and fine-tune models with ControlNet models running on Lambda Cloud.
it: Genera immagini e affina i modelli con ControlNet in esecuzione su Lambda Cloud.

source: Inference Job Submitted
it: Lavoro di inferenza inviato

source: Model: %(model)s
it: Modello: %(model)s

source: Job ID: %(jobid)s
it: ID Lavoro: %(jobid)s

source: Elapsed time
it: Tempo trascorso

source: Generate another image
it: Genera un'altra immagine

source: Waiting for your turn...
it: In attesa del tuo turno...

source: Waiting for Inference
it: In attesa dell'inferenza

source: Model Selection
it: Selezione Modello

source: Parameters
it: Parametri

source: Scale:
it: Scala:

source: Steps:
it: Passi:

source: Guidance:
it: Guida:

source: Prompt & Control Image
it: Prompt & Immagine di controllo

source: Upload Image:
it: Carica immagine:

source: Pencil
it: Matita

source: Eraser
it: Gomma

source: Undo
it: Annulla

source: Redo
it: Ripeti

source: Clear
it: Cancella

source: Run Inference
it: Avvia inferenza

source: Training Job Submitted
it: Lavoro di addestramento inviato

source: Job ID: %(job_id)s
it: ID lavoro: %(job_id)s

source: Waiting for Training
it: In attesa dell'addestramento

source: Mode
it: Modalità

source: Fine-tune existing model
it: Affina modello esistente

source: Create new model
it: Crea nuovo modello

source: Existing Model:
it: Modello esistente:

source: ControlNet Type:
it: Tipo di ControlNet:

source: Reuse as ControlNet?
it: Riutilizzare come ControlNet?

source: ControlNet Source:
it: Sorgente ControlNet:

source: Choose Existing ControlNet:
it: Scegli ControlNet esistente:

source: New Model Name:
it: Nome nuovo modello:

source: Quantization & Precision
it: Quantizzazione e precisione

source: Use N4 Quantization
it: Usa quantizzazione N4

source: Mixed Precision
it: Precisione mista

source: Training Parameters
it: Parametri di addestramento

source: Learning Rate:
it: Tasso di apprendimento:

source: Batch Size:
it: Dimensione batch:

source: Gradient Accumulation:
it: Accumulo gradienti:

source: Resolution:
it: Risoluzione:

source: Checkpoint Steps:
it: Passi checkpoint:

source: Validation Steps:
it: Passi di validazione:

source: Validation
it: Validazione

source: Validation Image:
it: Immagine di validazione:

source: Start Training
it: Avvia addestramento
